results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acks1-prod12-complz4-trial2/producer-perf-7.log
producer_index=7
producer_count=12
producer_records=8333
producer_throughput=833
1 records sent, 0.1 records/sec (0.00 MB/sec), 15422.0 ms avg latency, 15422.0 ms max latency.
326 records sent, 61.8 records/sec (0.60 MB/sec), 5506.2 ms avg latency, 7564.0 ms max latency.
1079 records sent, 203.2 records/sec (1.98 MB/sec), 8466.8 ms avg latency, 11211.0 ms max latency.
814 records sent, 154.0 records/sec (1.50 MB/sec), 10733.4 ms avg latency, 12843.0 ms max latency.
1232 records sent, 245.9 records/sec (2.40 MB/sec), 14465.3 ms avg latency, 16393.0 ms max latency.
8333 records sent, 202.754325 records/sec (1.98 MB/sec), 7984.53 ms avg latency, 16393.00 ms max latency, 8310 ms 50th, 15110 ms 95th, 15796 ms 99th, 16359 ms 99.9th.